<a href="https://colab.research.google.com/github/Austinxdsouza/2024-Python_SQL_projets/blob/main/SQL_David_Roche_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
--# INSERT DATA INTO [master].[dbo].[Table_A] USING SELECT STATEMENT
--insert into [master].[dbo].[Table_A] select 1234,'20181001 00:08:45','20181001 00:09:15'
--insert into [master].[dbo].[Table_A] select 1234,'20181001 00:08:30','20181001 00:09:00'
--insert into [master].[dbo].[Table_A] select 1234,'20181001 00:09:30','20181001 00:10:00'
--insert into [master].[dbo].[Table_A] select 12345,'20181001 00:08:45','20181001 00:09:15'
--insert into [master].[dbo].[Table_A] select 12345,'20181001 00:09:30','20181001 00:10:00'
--insert into [master].[dbo].[Table_A] select 12345,'20181001 00:10:50','20181001 00:11:00'
--insert into [master].[dbo].[Table_A] select 12345,'20181001 00:09:50','20181001 00:10:00'
--insert into [master].[dbo].[Table_A] select 12345,'20181001 00:09:30','20181001 00:10:00'

-- # DELETE ROW BASED ON SPECIFIC COLUMN_NAME
DELETE FROM Table_A WHERE trainerid = 123;

SELECT * FROM Table_A

SELECT *
FROM Table_A AS t1, Table_A AS t2
WHERE t1.trainerid = 1234 AND t2.trainerid = 12345

-- # IDENTIFYING OVERLAPPING
SELECT
CASE WHEN
(t1.starttime BETWEEN t2.starttime AND t2.endtime) OR
(t1.endtime BETWEEN t2.starttime AND t2.endtime) OR
(t1.starttime < t2.starttime AND t1.endtime > t2.endtime) OR
(t1.starttime > t2.starttime AND t1.endtime < t2.endtime)
THEN
'YES'
END AS Overlapping
,t1.trainerid,t2.trainerid,t1.starttime, t1.endtime,t2.starttime,t2.endtime
FROM Table_A AS t1, Table_A AS t2
WHERE t1.trainerid = 1234 AND t2.trainerid = 12345
ORDER BY Overlapping DESC

-- # RESULT SET

YES	1234	12345	2018-10-01 00:09:30.000	2018-10-01 00:10:00.000	2018-10-01 00:09:30.000	2018-10-01 00:10:00.000
YES	1234	12345	2018-10-01 00:08:45.000	2018-10-01 00:09:15.000	2018-10-01 00:08:45.000	2018-10-01 00:09:15.000
YES	1234	12345	2018-10-01 00:08:30.000	2018-10-01 00:09:00.000	2018-10-01 00:08:45.000	2018-10-01 00:09:15.000
YES	1234	12345	2018-10-01 00:09:30.000	2018-10-01 00:10:00.000	2018-10-01 00:09:50.000	2018-10-01 00:10:00.000
NULL	1234	12345	2018-10-01 00:08:45.000	2018-10-01 00:09:15.000	2018-10-01 00:09:30.000	2018-10-01 00:10:00.000
NULL	1234	12345	2018-10-01 00:08:30.000	2018-10-01 00:09:00.000	2018-10-01 00:09:30.000	2018-10-01 00:10:00.000
NULL	1234	12345	2018-10-01 00:09:30.000	2018-10-01 00:10:00.000	2018-10-01 00:08:45.000	2018-10-01 00:09:15.000
NULL	1234	12345	2018-10-01 00:08:45.000	2018-10-01 00:09:15.000	2018-10-01 00:10:50.000	2018-10-01 00:11:00.000
NULL	1234	12345	2018-10-01 00:08:30.000	2018-10-01 00:09:00.000	2018-10-01 00:10:50.000	2018-10-01 00:11:00.000
NULL	1234	12345	2018-10-01 00:09:30.000	2018-10-01 00:10:00.000	2018-10-01 00:10:50.000	2018-10-01 00:11:00.000
NULL	1234	12345	2018-10-01 00:08:45.000	2018-10-01 00:09:15.000	2018-10-01 00:09:50.000	2018-10-01 00:10:00.000
NULL	1234	12345	2018-10-01 00:08:30.000	2018-10-01 00:09:00.000	2018-10-01 00:09:50.000	2018-10-01 00:10:00.000